ART-Badge/SDK/bsp_for_art-badge/libraries/inc/peripheral/rtl876x_spi.h
/**
*********************************************************************************************************
*               Copyright(c) 2015, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* \file     rtl876x_spi.h
* \brief    The header file of the peripheral SPI driver.
* \details  This file provides all SPI firmware functions.
* \author   elliot chen
* \date     2015-5-6
* \version  v1.0
* *********************************************************************************************************
*/

#ifndef _RTL876X_SPI_H_
#define _RTL876X_SPI_H_

#ifdef __cplusplus
extern "C" {
#endif


/**
 * \addtogroup  IO          Peripheral Drivers
 * \defgroup    SPI         SPI
 *
 * \brief       Manage the SPI peripheral functions.
 *
 * \ingroup     IO
 */

/*============================================================================*
 *                         Includes
 *============================================================================*/
#include "rtl876x.h"


/*============================================================================*
 *                         Types
 *============================================================================*/

/**
 * \defgroup    SPI_Exported_Types Init Params Struct
 *
 * \ingroup     SPI
 */

/**
 * \brief       SPI init structure definition.
 *
 * \ingroup     SPI_Exported_Types
 */

typedef struct
{
    uint16_t SPI_Direction;         /*!< Specifies the SPI unidirectional or bidirectional data mode.
                                            This parameter can be a value of \ref SPI_Data_Direction. */
    uint16_t SPI_Mode;              /*!< Specifies the SPI operating mode.
                                            This parameter can be a value of \ref SPI_Mode. */
    uint16_t SPI_DataSize;          /*!< Specifies the SPI data size.
                                            This parameter can be a value of \ref SPI_Data_Size. */
    uint16_t SPI_CPOL;              /*!< Specifies the serial clock steady state.
                                            This parameter can be a value of \ref SPI_Clock_Polarity */
    uint16_t SPI_CPHA;              /*!< Specifies the clock active edge for the bit capture.
                                            This parameter can be a value of \ref SPI_Clock_Phase */
    uint32_t SPI_SwapTxBitEn;       /*!< Specifies whether to swap SPI Tx data bit. */
    uint32_t SPI_SwapRxBitEn;       /*!< Specifies whether to swap SPI Rx data bit. */
    uint32_t SPI_SwapTxByteEn;      /*!< Specifies whether to swap SPI Tx data byte. */
    uint32_t SPI_SwapRxByteEn;      /*!< Specifies whether to swap SPI Rx data byte. */
    uint32_t SPI_ToggleEn;          /*!< Specifies whether to toggle when transfer done. */
    uint32_t SPI_BaudRatePrescaler; /*!< Specifies the speed of SCK clock. SPI Clock Speed = clk source/SPI_ClkDIV
                                            \note The communication clock is derived from the master clock. The slave clock does not need to be set. */
    uint16_t SPI_FrameFormat;       /*!< Specifies which serial protocol transfers the data.
                                            This parameter can be a value of \ref SPI_Frame_Format. */
    uint32_t SPI_TxThresholdLevel;  /*!< Specifies the transmit FIFO Threshold. */
    uint32_t SPI_RxThresholdLevel;  /*!< Specifies the receive FIFO Threshold. */
    uint32_t SPI_NDF;               /*!< Specifies the trigger condition in EEPROM mode.
                                            This parameter should be the value of the length of read data. */
    uint16_t SPI_TxDmaEn;           /*!< Specifies the Tx dma mode. */
    uint16_t SPI_RxDmaEn;           /*!< Specifies the Rx dma mode. */
    uint8_t SPI_TxWaterlevel;       /*!< Specifies the DMA tx water level. */
    uint8_t SPI_RxWaterlevel;       /*!< Specifies the DMA rx water level. */

} SPI_InitTypeDef;


/*============================================================================*
 *                         Constants
 *============================================================================*/

/**
 * \defgroup    SPI_Exported_Constants Macro Definitions
 *
 * \ingroup     SPI
 */

#define IS_SPI_ALL_PERIPH(PERIPH) (((PERIPH) == SPI0) || \
                                   ((PERIPH) == SPI1))

#define IS_SPI_CLOCK_SPEED(SPEED) (((SPEED) >= 0x01) && ((SPEED) <= 40000000))

/**
 * \defgroup    SPI_Data_Direction SPI Data Direction
 * \{
 * \ingroup     SPI_Exported_Constants
 */
#define SPI_Direction_FullDuplex        ((uint16_t)0x0000)
#define SPI_Direction_TxOnly            ((uint16_t)0x0001)
#define SPI_Direction_RxOnly            ((uint16_t)0x0002)
#define SPI_Direction_EEPROM            ((uint16_t)0x0003)
/** \} */

#define IS_SPI_DIRECTION_MODE(MODE) (((MODE) == SPI_Direction_FullDuplex) || \
                                     ((MODE) == SPI_Direction_RxOnly) || \
                                     ((MODE) == SPI_Direction_TxOnly) || \
                                     ((MODE) == SPI_Direction_EEPROM))

/**
 * \defgroup    SPI_Mode SPI Mode
 * \{
 * \ingroup     SPI_Exported_Constants
 */

#define SPI_Mode_Master                         ((uint16_t)0x0104)
#define SPI_Mode_Slave                          ((uint16_t)0x0000)
/** \} */
#define IS_SPI_MODE(MODE) (((MODE) == SPI_Mode_Master) || \
                           ((MODE) == SPI_Mode_Slave))

/**
 * \defgroup    SPI_Data_Size SPI Data Size
 * \{
 * \ingroup     SPI_Exported_Constants
 */

#define SPI_DataSize_4b                 ((uint16_t)0x0003)
#define SPI_DataSize_5b                 ((uint16_t)0x0004)
#define SPI_DataSize_6b                 ((uint16_t)0x0005)
#define SPI_DataSize_7b                 ((uint16_t)0x0006)
#define SPI_DataSize_8b                 ((uint16_t)0x0007)
#define SPI_DataSize_9b                 ((uint16_t)0x0008)
#define SPI_DataSize_10b                 ((uint16_t)0x0009)
#define SPI_DataSize_11b                 ((uint16_t)0x000a)
#define SPI_DataSize_12b                 ((uint16_t)0x000b)
#define SPI_DataSize_13b                 ((uint16_t)0x000c)
#define SPI_DataSize_14b                 ((uint16_t)0x000d)
#define SPI_DataSize_15b                 ((uint16_t)0x000e)
#define SPI_DataSize_16b                 ((uint16_t)0x000f)
#define SPI_DataSize_17b                 ((uint16_t)0x0010)
#define SPI_DataSize_18b                 ((uint16_t)0x0011)
#define SPI_DataSize_19b                 ((uint16_t)0x0012)
#define SPI_DataSize_20b                 ((uint16_t)0x0013)
#define SPI_DataSize_21b                 ((uint16_t)0x0014)
#define SPI_DataSize_22b                 ((uint16_t)0x0015)
#define SPI_DataSize_23b                 ((uint16_t)0x0016)
#define SPI_DataSize_24b                 ((uint16_t)0x0017)
#define SPI_DataSize_25b                 ((uint16_t)0x0018)
#define SPI_DataSize_26b                 ((uint16_t)0x0019)
#define SPI_DataSize_27b                 ((uint16_t)0x001A)
#define SPI_DataSize_28b                 ((uint16_t)0x001B)
#define SPI_DataSize_29b                 ((uint16_t)0x001C)
#define SPI_DataSize_30b                 ((uint16_t)0x001D)
#define SPI_DataSize_31b                 ((uint16_t)0x001E)
#define SPI_DataSize_32b                 ((uint16_t)0x001F)
/** \} */
#define IS_SPI_DATASIZE(DATASIZE) (((DATASIZE) == SPI_DataSize_4b)  || \
                                   ((DATASIZE) == SPI_DataSize_5b)  || \
                                   ((DATASIZE) == SPI_DataSize_6b)  || \
                                   ((DATASIZE) == SPI_DataSize_7b)  || \
                                   ((DATASIZE) == SPI_DataSize_8b)  || \
                                   ((DATASIZE) == SPI_DataSize_9b)  || \
                                   ((DATASIZE) == SPI_DataSize_10b) || \
                                   ((DATASIZE) == SPI_DataSize_11b) || \
                                   ((DATASIZE) == SPI_DataSize_12b) || \
                                   ((DATASIZE) == SPI_DataSize_13b) || \
                                   ((DATASIZE) == SPI_DataSize_14b) || \
                                   ((DATASIZE) == SPI_DataSize_15b) || \
                                   ((DATASIZE) == SPI_DataSize_16b) || \
                                   ((DATASIZE) == SPI_DataSize_17b) || \
                                   ((DATASIZE) == SPI_DataSize_18b) || \
                                   ((DATASIZE) == SPI_DataSize_19b) || \
                                   ((DATASIZE) == SPI_DataSize_20b) || \
                                   ((DATASIZE) == SPI_DataSize_21b) || \
                                   ((DATASIZE) == SPI_DataSize_22b) || \
                                   ((DATASIZE) == SPI_DataSize_23b) || \
                                   ((DATASIZE) == SPI_DataSize_24b) || \
                                   ((DATASIZE) == SPI_DataSize_25b) || \
                                   ((DATASIZE) == SPI_DataSize_26b) || \
                                   ((DATASIZE) == SPI_DataSize_27b) || \
                                   ((DATASIZE) == SPI_DataSize_28b) || \
                                   ((DATASIZE) == SPI_DataSize_29b) || \
                                   ((DATASIZE) == SPI_DataSize_30b) || \
                                   ((DATASIZE) == SPI_DataSize_31b) || \
                                   ((DATASIZE) == SPI_DataSize_32b))

/**
 * \defgroup    SPI_BaudRate_Prescaler SPI BaudRate Prescaler Value
 * \{
 * \ingroup     SPI_Exported_Constants
 */

#define SPI_BaudRatePrescaler_2         ((uint32_t)0x0002)
#define SPI_BaudRatePrescaler_4         ((uint32_t)0x0004)
#define SPI_BaudRatePrescaler_6         ((uint32_t)0x0006)
#define SPI_BaudRatePrescaler_8         ((uint32_t)0x0008)
#define SPI_BaudRatePrescaler_10        ((uint32_t)0x000A)
#define SPI_BaudRatePrescaler_12        ((uint32_t)0x000C)
#define SPI_BaudRatePrescaler_14        ((uint32_t)0x000E)
#define SPI_BaudRatePrescaler_16        ((uint32_t)0x0010)
#define SPI_BaudRatePrescaler_32        ((uint32_t)0x0020)
#define SPI_BaudRatePrescaler_64        ((uint32_t)0x0040)
#define SPI_BaudRatePrescaler_128       ((uint32_t)0x0080)
#define SPI_BaudRatePrescaler_256       ((uint32_t)0x0100)
/** \} */
#define IS_SPI_BAUDRATE_PRESCALER(PRESCALER) (((PRESCALER) == SPI_BaudRatePrescaler_2) || \
                                              ((PRESCALER) == SPI_BaudRatePrescaler_4) || \
                                              ((PRESCALER) == SPI_BaudRatePrescaler_8) || \
                                              ((PRESCALER) == SPI_BaudRatePrescaler_10) || \
                                              ((PRESCALER) == SPI_BaudRatePrescaler_12) || \
                                              ((PRESCALER) == SPI_BaudRatePrescaler_14) || \
                                              ((PRESCALER) == SPI_BaudRatePrescaler_16) || \
                                              ((PRESCALER) == SPI_BaudRatePrescaler_32) || \
                                              ((PRESCALER) == SPI_BaudRatePrescaler_64) || \
                                              ((PRESCALER) == SPI_BaudRatePrescaler_128) || \
                                              ((PRESCALER) == SPI_BaudRatePrescaler_256))

/**
 * \defgroup    SPI_Clock_Polarity SPI Clock Polarity
 * \{
 * \ingroup     SPI_Exported_Constants
 */

#define SPI_CPOL_Low                    ((uint16_t)0x0000)
#define SPI_CPOL_High                   ((uint16_t)0x0001)
/** \} */
#define IS_SPI_CPOL(CPOL) (((CPOL) == SPI_CPOL_Low) || \
                           ((CPOL) == SPI_CPOL_High))

/**
 * \defgroup    SPI_Clock_Phase SPI Clock Phase
 * \{
 * \ingroup     SPI_Exported_Constants
 */

