ART-Badge/SDK/bsp_for_art-badge/libraries/inc/peripheral/rtl876x_spi.h
#define SPI_CPHA_1Edge                  ((uint16_t)0x0000)
#define SPI_CPHA_2Edge                  ((uint16_t)0x0001)
/** \} */
#define IS_SPI_CPHA(CPHA) (((CPHA) == SPI_CPHA_1Edge) || \
                           ((CPHA) == SPI_CPHA_2Edge))

/**
 * \defgroup    SPI_Frame_Format SPI Frame Format
 * \{
 * \ingroup     SPI_Exported_Constants
 */

#define SPI_Frame_Motorola              ((uint16_t)0x0000)
#define SPI_Frame_TI_SSP                ((uint16_t)0x0001)
#define SPI_Frame_NS_MICROWIRE          ((uint16_t)0x0002)
#define SPI_Frame_Reserve               ((uint16_t)0x0003)
/** \} */
#define IS_SPI_FRAME_FORMAT(FRAME) (((FRAME) == SPI_Frame_Motorola) || \
                                    ((FRAME) == SPI_Frame_TI_SSP) || \
                                    ((FRAME) == SPI_Frame_NS_MICROWIRE) || \
                                    ((FRAME) == SPI_Frame_Reserve))

/**
 * \defgroup    SPI_Flags_Definition SPI Flags Definition
 * \{
 * \ingroup     SPI_Exported_Constants
 */

#define SPI_FLAG_BUSY                   ((uint16_t)0x0001)
#define SPI_FLAG_TFNF                   ((uint16_t)0x0002)
#define SPI_FLAG_TFE                    ((uint16_t)0x0004)
#define SPI_FLAG_RFNE                   ((uint16_t)0x0008)
#define SPI_FLAG_RFF                    ((uint16_t)0x0010)
#define SPI_FLAG_TXE                    ((uint16_t)0x0020)
#define SPI_FLAG_DCOL                   ((uint16_t)0x0040)
/** \} */
#define IS_SPI_GET_FLAG(FLAG)   (((FLAG) == SPI_FLAG_DCOL) || ((FLAG) == SPI_FLAG_TXE) || \
                                 ((FLAG) == SPI_FLAG_RFF) || ((FLAG) == SPI_FLAG_RFNE) || \
                                 ((FLAG) == SPI_FLAG_TFE) || ((FLAG) == SPI_FLAG_TFNF) || \
                                 ((FLAG) == SPI_FLAG_BUSY))

/**
 * \defgroup    SPI_Interrupt_Definition SPI Interrupt Definition
 * \{
 * \ingroup     SPI_Exported_Constants
 */

#define SPI_INT_TXE                  ((uint8_t)BIT(0))
#define SPI_INT_TXO                  ((uint8_t)BIT(1))
#define SPI_INT_RXU                  ((uint8_t)BIT(2))
#define SPI_INT_RXO                  ((uint8_t)BIT(3))
#define SPI_INT_RXF                  ((uint8_t)BIT(4))
#define SPI_INT_MST                  ((uint8_t)BIT(5))
#define SPI_INT_TUF                  ((uint8_t)BIT(6))
#define SPI_INT_RIG                  ((uint8_t)BIT(7))
/** \} */

#define IS_SPI_CONFIG_IT(IT) (((IT) == SPI_INT_TXE) || \
                              ((IT) == SPI_INT_TXO) || \
                              ((IT) == SPI_INT_RXU) || \
                              ((IT) == SPI_INT_RXO) || \
                              ((IT) == SPI_INT_RXF) || \
                              ((IT) == SPI_INT_MST) || \
                              ((IT) == SPI_INT_TUF) || \
                              ((IT) == SPI_INT_RIG) )
/**
 * \defgroup    SPI_GDMA_Transfer_Request SPI GDMA Transfer Request
 * \{
 * \ingroup     SPI_Exported_Constants
 */

#define SPI_GDMAReq_Tx               ((uint16_t)0x0002)
#define SPI_GDMAReq_Rx               ((uint16_t)0x0001)
/** \} */
#define IS_SPI_GDMAREQ(GDMAREQ) ((((GDMAREQ) & (uint16_t)0xFFFC) == 0x00) && ((GDMAREQ) != 0x00))

/**
 * \defgroup    SPI_Swap_Enable SPI Swap Enable
 * \{
 * \ingroup     SPI_Exported_Constants
 */

#define SPI_SWAP_ENABLE                ((uint32_t)0x0001)
#define SPI_SWAP_DISABLE               ((uint32_t)0x0000)
/** \} */
#define IS_SPI_SWAPMODE(mode) (((mode) == SPI_SWAP_ENABLE) || \
                               ((mode) == SPI_SWAP_DISABLE))


/*============================================================================*
 *                         Functions
 *============================================================================*/

/**
 * \defgroup    SPI_Exported_functions  Peripheral APIs
 * \{
 * \ingroup     SPI
 */

/**
 * \brief   Deinitializes the SPIx peripheral registers to their default reset values.
 * \param[in] SPIx: Where x can be 0 or 1 to select the SPI peripheral.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_spi_init(void)
 * {
 *     SPI_DeInit(SPI0);
 * }
 * \endcode
 */
void SPI_DeInit(SPI_TypeDef *SPIx);

/**
 * \brief   Initializes the SPIx peripheral according to the specified
 *          parameters in the SPI_InitStruct.
 * \param[in] SPIx: Where x can be 0 or 1 to select the SPI peripheral.
 * \param[in] SPI_InitStruct: Pointer to a SPI_InitTypeDef structure that
 *            contains the configuration information for the specified SPI peripheral.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_spi_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_SPI0, APBPeriph_SPI0_CLOCK, ENABLE);

 *     SPI_InitTypeDef  SPI_InitStruct;
 *     SPI_StructInit(&SPI_InitStruct);
 *
 *     SPI_InitStruct.SPI_Direction   = SPI_Direction_EEPROM;
 *     SPI_InitStruct.SPI_Mode        = SPI_Mode_Master;
 *     SPI_InitStruct.SPI_DataSize    = SPI_DataSize_8b;
 *     SPI_InitStruct.SPI_CPOL        = SPI_CPOL_High;
 *     SPI_InitStruct.SPI_CPHA        = SPI_CPHA_2Edge;
 *     SPI_InitStruct.SPI_BaudRatePrescaler  = 100;
 *     SPI_InitStruct.SPI_RxThresholdLevel  = 1 - 1;
 *     SPI_InitStruct.SPI_NDF               = 1 - 1;
 *     SPI_InitStruct.SPI_FrameFormat = SPI_Frame_Motorola;
 *
 *     SPI_Init(SPI0, &SPI_InitStruct);
 * }
 * \endcode
 */
void SPI_Init(SPI_TypeDef *SPIx, SPI_InitTypeDef *SPI_InitStruct);

/**
 * \brief  Fills each SPI_InitStruct member with its default value.
 * \param[in]  SPI_InitStruct: Pointer to a SPI_InitTypeDef structure which will be initialized.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_spi_init(void)
 * {
 *
 *     RCC_PeriphClockCmd(APBPeriph_SPI0, APBPeriph_SPI0_CLOCK, ENABLE);

 *     SPI_InitTypeDef  SPI_InitStruct;
 *     SPI_StructInit(&SPI_InitStruct);
 *
 *     SPI_InitStruct.SPI_Direction   = SPI_Direction_EEPROM;
 *     SPI_InitStruct.SPI_Mode        = SPI_Mode_Master;
 *     SPI_InitStruct.SPI_DataSize    = SPI_DataSize_8b;
 *     SPI_InitStruct.SPI_CPOL        = SPI_CPOL_High;
 *     SPI_InitStruct.SPI_CPHA        = SPI_CPHA_2Edge;
 *     SPI_InitStruct.SPI_BaudRatePrescaler  = 100;
 *     SPI_InitStruct.SPI_RxThresholdLevel  = 1 - 1;
 *     SPI_InitStruct.SPI_NDF               = 1 - 1;
 *     SPI_InitStruct.SPI_FrameFormat = SPI_Frame_Motorola;
 *
 *     SPI_Init(SPI0, &SPI_InitStruct);
 * }
 * \endcode
 */
void SPI_StructInit(SPI_InitTypeDef *SPI_InitStruct);

/**
 * \brief  Enables or disables the selected SPI peripheral.
 * \param[in]  SPIx: Where x can be 0 or 1 to select the SPI peripheral.
 * \param[in]  NewState: New state of the SPIx peripheral.
 *      This parameter can be: ENABLE or DISABLE.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_spi_init(void)
 * {
 *
 *     RCC_PeriphClockCmd(APBPeriph_SPI0, APBPeriph_SPI0_CLOCK, ENABLE);
 *
 *     SPI_InitTypeDef  SPI_InitStruct;
 *     SPI_StructInit(&SPI_InitStruct);
 *
 *     SPI_InitStruct.SPI_Direction   = SPI_Direction_EEPROM;
 *     SPI_InitStruct.SPI_Mode        = SPI_Mode_Master;
 *     SPI_InitStruct.SPI_DataSize    = SPI_DataSize_8b;
 *     SPI_InitStruct.SPI_CPOL        = SPI_CPOL_High;
 *     SPI_InitStruct.SPI_CPHA        = SPI_CPHA_2Edge;
 *     SPI_InitStruct.SPI_BaudRatePrescaler  = 100;
 *     SPI_InitStruct.SPI_RxThresholdLevel  = 1 - 1;
 *     SPI_InitStruct.SPI_NDF               = 1 - 1;
 *     SPI_InitStruct.SPI_FrameFormat = SPI_Frame_Motorola;
 *
 *     SPI_Init(SPI0, &SPI_InitStruct);
 *     SPI_Cmd(SPI0, ENABLE);
 * }
 * \endcode
 */
void SPI_Cmd(SPI_TypeDef *SPIx, FunctionalState NewState);

/**
 * \brief  Transmits a number of bytes through the SPIx peripheral.
 * \param[in] SPIx: Where x can be 0 or 1 to select the SPI peripheral.
 * \param[in] pBuf: Bytes to be transmitted.
 * \param[in] len: Byte length to be transmitted.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     uint8_t data_buf[] = {0x01,0x02,0x03};
 *     SPI_SendBuffer(SPI0, data_buf, sizeof(data_buf));
 * }
 * \endcode
 */
void SPI_SendBuffer(SPI_TypeDef *SPIx, uint8_t *pBuf, uint16_t len);

/**
  * \brief  Transmits a number of halfWords through the SPIx peripheral.
  * \param[in] SPIx: Where x can be 0 or 1 to select the SPI peripheral.
  * \param[in] pBuf: Halfwords to be transmitted.
  * \param[in] len: Halfwords length to be transmitted.
  * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     uint16_t data_buf[] = {0x0102,0x0203,0x0304};
 *     SPI_SendHalfWord(SPI0, data_buf, sizeof(data_buf));
 * }
 * \endcode
  */
void SPI_SendHalfWord(SPI_TypeDef *SPIx, uint16_t *pBuf, uint16_t len);

/**
 * \brief  Transmits a number of words through the SPIx peripheral.
 * \param[in] SPIx: Where x can be 0 or 1 to select the SPI peripheral.
 * \param[in] pBuf: Words to be transmitted.
 * \param[in] len: Word length to be transmitted.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     uint32_t data_buf[] = {0x01020304,0x02030405,0x03040506};
 *     SPI_SendWord(SPI0, data_buf, sizeof(data_buf));
 * }
 * \endcode
 */
void SPI_SendWord(SPI_TypeDef *SPIx, uint32_t *pBuf, uint16_t len);

/**
 * \brief  Enable or disable the specified SPI interrupt source.
 * \param[in] SPIx: Where x can be 0 or 1 to select the SPI peripheral.
 * \param[in] SPI_IT: Specifies the SPI interrupt source to be enabled or disabled.
 *      This parameter can be one of the following values:
 *      \arg SPI_INT_TXE: Transmit FIFO empty interrupt source.
 *      \arg SPI_INT_TXO: Transmit FIFO overflow interrupt source.
 *      \arg SPI_INT_RXU: Receive FIFO underflow interrupt source.
 *      \arg SPI_INT_RXO: Receive FIFO overflow interrupt source.
 *      \arg SPI_INT_RXF: Receive FIFO full interrupt source.
 *      \arg SPI_INT_MST: Multi-Master contention interrupt source.
 * \param[in] NewState: New state of the specified SPI interrupt source.
 *      This parameter can be: ENABLE or DISABLE.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_INTConfig(SPI0, SPI_INT_RXF, ENABLE);
 * }
 * \endcode
 */
void SPI_INTConfig(SPI_TypeDef *SPIx, uint8_t SPI_IT, FunctionalState NewState);

/**
 * \brief  Clear the specified SPI interrupt pending bit.
 * \param[in] SPIx: Where x can be 0 or 1 to select the SPI peripheral.
 * \param[in] SPI_IT: Specifies the SPI interrupt to clear.
 *      This parameter can be one of the following values:
 *      \arg SPI_INT_MST: Multi-Master Contention Interrupt.
 *      \arg SPI_INT_RXO: Receive FIFO Overflow Interrupt.
 *      \arg SPI_INT_RXU: Receive FIFO Underflow Interrupt.
 *      \arg SPI_INT_TXO: Transmit FIFO Overflow Interrupt.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_ClearINTPendingBit(SPI0, SPI_INT_RXF);
 * }
 * \endcode
 */
void SPI_ClearINTPendingBit(SPI_TypeDef *SPIx, uint16_t SPI_IT);

/**
 * \brief  Transmits a data through the SPIx peripheral.
 * \param[in] SPIx: Where x can be 0 or 1 to select the SPI peripheral.
 * \param[in] Data: Data to be transmitted.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     uint32_t data = 0x01020304;
 *     SPI_SendData(SPI0, data);
 * }
 * \endcode
 */
__STATIC_INLINE void SPI_SendData(SPI_TypeDef *SPIx, uint32_t Data)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));

    SPIx->DR[0] = Data;
    while (!(SPIx->SR & BIT(1)));
}

/**
 * \brief   Received data by the SPIx/I2Sx peripheral.
 * \param[in] SPIx: Where x can be 0 or 1.
 * \retval  The most recent received data.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     uint32_t data = SPI_ReceiveData(SPI0);
 * }
 * \endcode
 */
__STATIC_INLINE uint32_t SPI_ReceiveData(SPI_TypeDef *SPIx)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));

