ART-Badge/SDK/bsp_for_art-badge/libraries/inc/peripheral/rtl876x_spi.h
    return (uint32_t)SPIx->DR[0];
}

/**
 * \brief   Get data length in Tx FIFO through the SPIx peripheral.
 * \param[in] SPIx: Where x can be 0 or 1.
 * \return  Data length in Tx FIFO.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     uint8_t data_len = SPI_GetTxFIFOLen(SPI0);
 * }
 * \endcode
 */
__STATIC_INLINE uint8_t SPI_GetTxFIFOLen(SPI_TypeDef *SPIx)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));

    return (uint8_t)SPIx->TXFLR;
}

/**
 * \brief   Get data length in Rx FIFO through the SPIx peripheral.
 * \param[in] SPIx: Where x can be 0 or 1.
 * \return  Data length in Rx FIFO.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     uint8_t data_len = SPI_GetRxFIFOLen(SPI0);
 * }
 * \endcode
 */
__STATIC_INLINE uint8_t SPI_GetRxFIFOLen(SPI_TypeDef *SPIx)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    return (uint8_t)SPIx->RXFLR;
}

/**
 * \brief   Change SPI direction mode.
 * \param[in] SPIx: Where x can be 0 or 1.
 * \param[in] dir: Value of direction mode.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_ChangeDirection(SPI0, SPI_Direction_EEPROM);
 * }
 * \endcode
 */
__STATIC_INLINE void SPI_ChangeDirection(SPI_TypeDef *SPIx, uint16_t dir)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_SPI_DIRECTION_MODE(dir));

    /* Disable the selected SPI peripheral */
    SPIx->SSIENR &= ~0x01;

    /* Change SPI direction mode */
    SPIx->CTRLR0 &= ~(0x03 << 8);
    SPIx->CTRLR0 |= dir << 8;

    /* Enable the selected SPI peripheral */
    SPIx->SSIENR |= 0x01;
}

/**
 * \brief   Set read Data length only in EEPROM mode through the SPIx peripheral,which
            enables you to receive up to 64 KB of data in a continuous transfer.
 * \param[in] SPIx: Where x can be 0 or 1
 * \param[in] len: Length of read data which can be 1 to 65536.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_SetReadLen(SPI0, 100);
 * }
 * \endcode
 */
__STATIC_INLINE void SPI_SetReadLen(SPI_TypeDef *SPIx, uint16_t len)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));

    /* Disable the selected SPI peripheral */
    SPIx->SSIENR &= ~0x01;
    /* set read length in SPI EEPROM mode */
    SPIx->CTRLR1 = len - 1;
    /* Enable the selected SPI peripheral */
    SPIx->SSIENR |= 0x01;
}

/**
 * \brief   Set cs number through the SPIx peripheral.
 * \param[in] SPIx: Where x can be 0 or 1
 * \param[in] number: If SPIx is SPI0, number must be 0. If SPIx is SPI1, number can be 0 to 2.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_SetCSNumber(SPI1, 1);
 * }
 * \endcode
 */
__STATIC_INLINE void SPI_SetCSNumber(SPI_TypeDef *SPIx, uint8_t number)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));

    /* set cs number */
    SPIx->SER = BIT(number);
}

/**
 * \brief  Check whether the specified SPI interrupt is set.
 * \param[in]  SPIx: Where x can be 0 or 1
 * \param[in]  SPI_IT: Specifies the SPI interrupt to check.
 *      This parameter can be one of the following values:
 *      \arg SPI_INT_MST: Multi-Master Contention Interrupt.
 *      \arg SPI_INT_RXF: Receive FIFO Full Interrupt.
 *      \arg SPI_INT_RXO: Receive FIFO Overflow Interrupt.
 *      \arg SPI_INT_RXU: Receive FIFO Underflow Interrupt.
 *      \arg SPI_INT_TXO: Transmit FIFO Overflow Interrupt .
 *      \arg SPI_INT_TXE: Transmit FIFO Empty Interrupt.
 * \return The new state of SPI_IT (SET or RESET).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     ITStatus int_status = SPI_GetINTStatus(SPI0, SPI_INT_RXF);
 * }
 * \endcode
 */
__STATIC_INLINE ITStatus SPI_GetINTStatus(SPI_TypeDef *SPIx, uint32_t SPI_IT)
{
    ITStatus bit_status = RESET;

    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_SPI_CONFIG_IT(SPI_IT));

    if ((SPIx->ISR & SPI_IT) != (uint32_t)RESET)
    {
        bit_status = SET;
    }

    /* Return the SPI_IT status */
    return  bit_status;
}

/**
 * \brief  Check whether the specified SPI flag is set.
 * \param[in]  SPIx: Where x can be 0 or 1
 * \param[in]  SPI_FLAG: Specifies the SPI flag to check.
 *      This parameter can be one of the following values:
 *      \arg SPI_FLAG_DCOL: Data Collision Error flag.Set if it is actively transmitting in master mode when another master selects this device as a slave.
 *      \arg SPI_FLAG_TXE: Transmission error flag.Set if the transmit FIFO is empty when a transfer is started in slave mode.
 *      \arg SPI_FLAG_RFF: Receive FIFO full flag. Set if the receive FIFO is completely full.
 *      \arg SPI_FLAG_RFNE: Receive FIFO Not Empty flag.Set if receive FIFO is not empty.
 *      \arg SPI_FLAG_TFE: Transmit FIFO Empty flag.Set if transmit FIFO is empty.
 *      \arg SPI_FLAG_TFNF: Transmit FIFO Not Full flag.Set if transmit FIFO is not full.
 *      \arg SPI_FLAG_BUSY: SPI Busy flag.Set if it is actively transferring data.reset if it is idle or disabled.
 * \return The new state of SPI_FLAG (SET or RESET).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     FlagStatus flag_status = SPI_GetFlagState(SPI0, SPI_FLAG_TXE);
 *
 * }
 * \endcode
 */
__STATIC_INLINE FlagStatus SPI_GetFlagState(SPI_TypeDef *SPIx, uint8_t SPI_FLAG)
{
    FlagStatus bitstatus = RESET;

    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_SPI_GET_FLAG(SPI_FLAG));

    /* Check the status of the specified SPI flag */
    if ((SPIx->SR & SPI_FLAG) != (uint8_t)RESET)
    {
        /* SPI_FLAG is set */
        bitstatus = SET;
    }

    /* Return the SPI_FLAG status */
    return  bitstatus;
}

/**
 * \brief   Enables or disables the SPIx GDMA interface.
 * \param[in] SPIx: Where x can be 0 or 1
 * \param[in] SPI_GDMAReq: Specifies the SPI GDMA transfer request to be enabled or disabled.
 *      This parameter can be one of the following values:
 *      \arg SPI_GDMAReq_Tx: Tx buffer DMA transfer request.
 *      \arg SPI_GDMAReq_Rx: Rx buffer DMA transfer request.
 * \param[in]  NewState: New state of the selected SPI GDMA transfer request.
 *      This parameter can be: ENABLE or DISABLE.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_GDMACmd(SPI0, SPI_GDMAReq_Tx, ENABLE);
 * }
 * \endcode
 */
__STATIC_INLINE void SPI_GDMACmd(SPI_TypeDef *SPIx, uint16_t SPI_GDMAReq, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_SPI_ALL_PERIPH(SPIx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    assert_param(IS_SPI_GDMAREQ(SPI_GDMAReq));

    if (NewState != DISABLE)
    {
        /* Enable the selected SPI GDMA request */
        SPIx->DMACR |= SPI_GDMAReq;
    }
    else
    {
        /* Disable the selected SPI GDMA request */
        SPIx->DMACR &= (uint16_t)~(SPI_GDMAReq);
    }
}
/**
 * \brief  Change SPI speed daynamically.
 * \param[in]  SPIx: Where x can be 0 or 1.
 * \param[in]  precalser: Value of prescaler.
 *      This parameter can be one of the following values:
 *      \arg  SPI_BaudRatePrescaler_2
 *      \arg  SPI_BaudRatePrescaler_4
 *      \arg  SPI_BaudRatePrescaler_6
 *      \arg  SPI_BaudRatePrescaler_8
 *      \arg  SPI_BaudRatePrescaler_10
 *      \arg  SPI_BaudRatePrescaler_12
 *      \arg  SPI_BaudRatePrescaler_14
 *      \arg  SPI_BaudRatePrescaler_16
 *      \arg  SPI_BaudRatePrescaler_32
 *      \arg  SPI_BaudRatePrescaler_64
 *      \arg  SPI_BaudRatePrescaler_128
 *      \arg  SPI_BaudRatePrescaler_256
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_Change_CLK(SPI0, SPI_BaudRatePrescaler_2);
 * }
 * \endcode
 */
__STATIC_INLINE void SPI_Change_CLK(SPI_TypeDef *SPIx, uint32_t prescaler)
{
    SPIx->BAUDR = prescaler % 0xFFFF;
}

/**
 * \brief   Set SPI Rx sample delay.
 * \param[in] SPIx: Where x can be 0 or 1.
 * \param[in] delay: This parameter can be 0 to 255.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void spi_demo(void)
 * {
 *     SPI_SetRxSampleDly(SPI0, 1);
 * }
 * \endcode
 */
__STATIC_INLINE void SPI_SetRxSampleDly(SPI_TypeDef *SPIx, uint32_t delay)
{
    SPIx->RX_SAMPLE_DLY = delay & 0xFF;
}

/** \} */ /* End of group SPI_Exported_Functions */

#ifdef __cplusplus
}
#endif

#endif /* _RTL876X_SPI_H_ */


/******************* (C) COPYRIGHT 2015 Realtek Semiconductor Corporation *****END OF FILE****/

